<?php
$漢和詞典=array(
'一年'=>'*1年',
'二年'=>'*2年',
'三年'=>'*3年',
'四年'=>'*4[よ]年', // *
'五年'=>'*5年',
'六年'=>'*6年',
'七年'=>'*7[なな]年:7[しち]年', // *
'八年'=>'*8年',
'九年'=>'*9[きゅう]年', // *
'十年'=>'*10年',
'二零二四年'=>'*2024[にせんにじゅうよ]年',  
'二零二五年'=>'*2025[にせんにじゅうご]年',
'二零二六年'=>'*2025[にせんにじゅうろく]年',

'一月'=>'*1[いち]月[がつ➂]',
'二月'=>'*2[]に月[がつ➂]',
'三月'=>'*3[さん]月[がつ➀]',
'四月'=>'*4[し]月[がつ➂]', // *
'五月'=>'*5[ご]月[がつ➀]',
'六月'=>'*6[ろく]月[がつ➂]',
'七月'=>'*7[しち]月[がつ➂]', // *
'八月'=>'*8[はち]月[がつ➂]',
'九月'=>'*9[く]月[がつ➀]', // *
'十月'=>'*10[じゅう]月[がつ➂]',
'十一月'=>'*11[じゅういち]月[がつ⓪]',
'十二月'=>'*12[じゅうに]月[がつ➂]',

'一日'=>'*1日[ついたち➂]', // 朔日
'二日'=>'*2日[ふつか⓪]', //
'三日'=>'*3日[みっか⓪]', //
'四日'=>'*4日[よっか⓪]', //
'五日'=>'*5日[いつか➂]', //
'六日'=>'*6日[むいか⓪]', // 
'七日'=>'*7日[なのか⓪]', //
'八日'=>'*8日[ようか⓪]', //
'九日'=>'*9日[ここのか➂]', //
'十日'=>'*10日[とおか⓪]', //
'十一日'=>'*11[じゅういち]日',
'十二日'=>'*12[じゅうに]日',
'十三日'=>'*13[じゅうさん]日',
'十四日'=>'*14日[[じゅうよっか]', // ➀ *
'十五日'=>'*15[じゅうご]日',
'十六日'=>'*16[じゅうろく]日',
'十七日'=>'*17[じゅうしち]日', // *
'十八日'=>'*18[じゅうはち]日',
'十九日'=>'*19[じゅうく]日', // *
'二十日'=>'*20日[はつか⓪]', // *
'二十一日'=>'*21[にじゅういち]日',
'二十二日'=>'*22[にじゅうに]日',
'二十三日'=>'*23[にじゅうさん]日',
'二十四日'=>'*24日[にじゅうよっか]', // *➀･⓪
'二十五日'=>'*26[にじゅうご]日',
'二十六日'=>'*26[にじゅうろく]日',
'二十七日'=>'*27[にじゅうしち]日', // *
'二十八日'=>'*28[にじゅうはち]日',
'二十九日'=>'*29[にじゅうく]日', // *
'三十日'=>'*30[さんじゅう]日',
'三十一日'=>'*31[さんじゅういち]日',

'禮拜日'=>'*日[に➁ち]曜[よ➁う]日[び]',
'禮拜一'=>'*月[げ➁つ]曜[よ➁う]日[び]',
'禮拜二'=>'*火[か]曜[➁よ➁う]日[び]',
'禮拜三'=>'*水[す➁い]曜[よ➁う]日[び]',
'禮拜四'=>'*木[も➁く]曜[よ➁う]日[び]',
'禮拜五'=>'*金[き➁ん]曜[よ➁う]日[び]',
'禮拜六'=>'*土[ど]曜[➁よ➁う]日[び]',

''=>'*',
''=>'*',
''=>'*',
''=>'*',
''=>'*',
''=>'*',
''=>'*',


''=>'*[⓪➀➁➂]',
''=>'*[⓪➀➁➂]',
''=>'*[⓪➀➁➂]',
''=>'*[⓪➀➁➂]',
''=>'*[⓪➀➁➂]',
''=>'*[⓪➀➁➂]',
''=>'*[⓪➀➁➂]',
''=>'*[⓪➀➁➂]',
''=>'*[⓪➀➁➂]',

);
?>