<?php
$粵和詞典=array(
'gaa2ming4'=>
'*あア*いイ*うウ*えエ*おオ
*かカ*きキ*くク*けケ*こコ
*がガ*ぎギ*ぐグ*げゲ*ごゴ
*きゃキャ*きゅキュ*きょキョ
*ぎゃギャ*ぎゅギュ*ぎょギョ
*さサ*しシ*すス*せセ*そソ
*ざザ*じジ*ずズ*ぜゼ*ぞゾ
*しゃシャ*しゅシュ*しょショ
*じゃジャ*じゅジュ*じょジョ
*たタ*ちチ*つツ*てテ*とト
*だダ*ぢヂ*づヅ*でデ*どド
*ちゃチャ*ちゅチュ*ちょチョ
*ぢゃヂャ*ぢゅヂュ*ぢょヂョ
*なナ*にニ*ぬヌ*ねネ*のノ
*にゃニャ*にゅニュ*にょニョ
*はハ*ひヒ*ふフ*へヘ*ほホ
*ばバ*びビ*ぶブ*べベ*ぼボ
*ぱパ*ぴピ*ぷプ*ぺペ*ぽポ
*ひゃヒャ*ひゅヒュ*ひょヒョ
*びゃビャ*びゅビュ*びょビョ
*ぴゃピャ*ぴゅピュ*ぴょピョ
*まマ*みミ*むム*めメ*もモ
*みゃミャ*みゅミュ*みょミョ
*やヤ*ゆユ*よヨ
*らラ*りリ*るル*れレ*ろロ
*りゃリャ*りゅリュ*りょリョ
*わワ*をヲ
*んン
*ヴ
*ゃゅょャュョ
*っッ
*ぁぃぅぇぉァィゥェォ
*ゐヰヸゑヱー
*゛゜
*か゜ nga あﾞエﾞ
㋐㋑㋒㋓㋔㋕㋖㋗㋘㋙㋚㋛㋜㋝㋞
㋟㋠㋡㋢㋣㋤㋥㋦㋧㋨㋩㋪㋫㋬㋭
㋮㋯㋰㋱㋲㋳㋴㋵㋶㋷㋸㋹㋺㋻㋼㋽㋾

',
'jat1gaai1'=>'*[いっ]階[かい⓪]', // *
'ji6gaai1'=>'*[に]階[かい⓪]',
'saam1gaai1'=>'*[さん]階[がい⓪]', // *
'sei3gaai1'=>'*[よん]階[かい⓪]',
'ng5gaai1'=>'*[ご]階[かい⓪]',
'luk6gaai1'=>'*[ろっ]階[かい⓪]', // *
'cat1gaai1'=>'*[なな]階[かい⓪]',
'baat3gaai1'=>'*[はっ]階[かい⓪]', // *
'gau2gaai1'=>'*[きゅう]階[かい]',
'sap6gaai1'=>'*[じゅっ]階[かい]', // *

'jat1seoi3'=>'*[いっ]歳',
'baat3seoi3'=>'*[はっ]歳',
'sap6seoi3'=>'*[じゅっ]歳',
'ji6sap6seoi3'=>'*はたち[➀]',

'jat1nin4'=>'*いち年[ねん➁]',
'ji6nin4'=>'*に年[ねん]',
'saam3nin4'=>'*さん年[ねん]',
'sei3nin4'=>'*よ年[ねん]', // *
'ng5nin4'=>'*ご年[ねん]',
'luk6nin4'=>'*ろく年[ねん]',
'cat1nin4'=>'*なな年[ねん]:しち年[ねん]', // *
'baat3nin4'=>'*はち年[ねん]',
'gau2nin4'=>'*きゅう年[ねん]', // *
'jat1ling4nin4'=>'*じゅう年[ねん]',
'ji6ling4ji6ng5nin4'=>'*にせんにじゅうご年[ねん]',

// 4 7 9
'jat1jut6'=>'*いち月[がつ➂]',
'ji6jut6'=>'*に月[がつ➂]',
'saam1jut6'=>'*さん月[がつ➀]',
'sei3jut6'=>'*[し]月[がつ➂]', // *
'ng5jut6'=>'*ご月[がつ➀]',
'luk6jut6'=>'*ろく月[がつ➂]',
'cat1jut6'=>'*しち月[がつ➂]', // *
'baat3jut6'=>'*はち月[がつ➂]',
'gau2jut6'=>'*く月[がつ➀]', // *
'sap6jut6'=>'*じゅう月[がつ➂]',
'sap6jat1jut6'=>'*じゅういち月[がつ⓪]',
'sap6ji6jut6'=>'*じゅうに月[がつ➂]',

'jat1jat6'=>'*ついたち[➂]', // 朔日
'ji6jat6'=>'*ふつか[⓪]', //
'saam1jat6'=>'*みっか[⓪]', //
'sei3jat6'=>'*よっか[⓪]', //
'ng5jat6'=>'*いつか[➂]', //
'luk6jat6'=>'*むいか[⓪]', // 
'cat1jat6'=>'*なのか[⓪]', //
'baat3jat6'=>'*ようか[⓪]', //
'gau2jat6'=>'*ここのか[➂]', //
'sap6jat6'=>'*とおか[⓪]', //
'sap6jat1jat6'=>'*じゅういち日[にち➂]',
'sap6ji6jat6'=>'*じゅうに日[にち]',
'sap6saam1jat6'=>'*じゅうさん日[にち]',
'sap6sei3jat6'=>'*じゅうよっか[➀-⓪]', //  *
'sap6ng5jat6'=>'*じゅうご日[にち]',
'sap6luk6jat6'=>'*じゅうろく日[にち]',
'sap6cat1jat6'=>'*じゅうしち日[にち]', // *
'sap6baat3jat6'=>'*じゅうはち日[にち]',
'sap6gau2jat6'=>'*じゅうく日[にち]', // *
'ji6sap6jat6'=>'*はつか[⓪]', // *
'ji6sap6jat1jat6'=>'*にじゅういち日[にち]',
'ji6sap6ji6jat6'=>'*にじゅうに日[にち]',
'ji6sap6saam1jat6'=>'*にじゅうさん日[にち]',
'ji6sap6sei3jat6'=>'*にじゅうよっか[➀-⓪]', // *
'ji6sap6ng5jat6'=>'*にじゅうご日[にち]',
'ji6sap6luk6jat6'=>'*にじゅうろく日[にち]',
'ji6sap6cat1jat6'=>'*にじゅうしち日[にち]', // *
'ji6sap6baat3jat6'=>'*にじゅうはち日[にち]',
'ji6sap6gau2jat6'=>'*にじゅうく日[にち]', // *
'saam1sap6jat6'=>'*さんじゅう日[にち]',
'saam1sap6jat1jat6'=>'*さんじゅういち日[にち]',

// 4 7 9
'ling4si4'=>'*[れい]時[じ➀]',
'jat1si4'=>'*[いち]時[じ➁]',
'ji6si4'=>'*[に]時[じ➀]',
'saam1si4'=>'*[さん]時[じ➀]',
'sei3si4'=>'*[よ]時[じ]', // *
'ng5si4'=>'*[ご]時[じ]',
'luk6si4'=>'*[ろく]時[じ➁]',
'cat1si4'=>'*[しち]時[じ➁]', // *
'baat3si4'=>'*[はち]時[じ➁]',
'gau2si4'=>'*[く]時[じ➀]', // *
'sap6si4'=>'*[じゅう]時[じ]',
'sap6jat1si4'=>'*[じゅういち]時[じ]',
'sap6ji6si4'=>'*[じゅうに]時[じ]',
'sap6saam1si4'=>'*[じゅうさん]時[じ➀]',
'sap6sei3si4'=>'*[じゅうよ]時[じ]', // *
'sap6ng5si4'=>'*[じゅうご]時[じ]',
'sap6luk6si4'=>'*[じゅうろく]時[じ➁]',
'sap6cat1si4'=>'*[じゅうしち]時[じ➁]', // *
'sap6baat3si4'=>'*[じゅうはち]時[じ➁]',
'sap6gau2si4'=>'*[じゅうく]時[じ➀]', // *
'ji6sap6si4'=>'*[にじゅう]時[じ]',
'ji6sap6jat1si4'=>'*[にじゅういち]時[じ]',
'ji6sap6ji6si4'=>'*[にじゅうに]時[じ]',
'ji6sap6saam1si4'=>'*[にじゅうさん]時[じ➀]',
'ji6sap6sei3si4'=>'*[にじゅうよ]時[じ]', // *

// 1, 3, 4, 6, 8, 10
'jat1fan1'=>'*[いっ]分[ぷん]', // *
'ji6fan1'=>'*[に]分[ふん]',
'saam1fan1'=>'*[さん]分[ぷん]', // *
'sei3fan1'=>'*[よん]分[ぷん]', // *
'ng5fan1'=>'*[ご]分[ふん]',
'luk6fan1'=>'*[ろっ]分[ぷん]', // *
'cat1fan1'=>'*[なな]分[ふん]',
'baat3fan1'=>'*[はっ]分[ぷん]', // *
'gau2fan1'=>'*[きゅう]分[ふん]',
'sap6fan1'=>'*[じゅっ]分[ぷん]', // *
'sap6jat1fan1'=>'*[じゅういっ]分[ぷん]',
'sap6ji6fan1'=>'*[じゅうに]分[ふん]',
'sap6saam1fan1'=>'*[じゅうさん]分[ぷん]', // *
'sap6sei3fan1'=>'*[じゅうよん]分[ぷん]', // *
'sap6ng5fan1'=>'*[じゅうご]分[ふん]',
'sap6luk6fan1'=>'*[じゅうろっ]分[ぷん]', // *
'sap6cat1fan1'=>'*[じゅうなな]分[ふん]',
'sap6baat3fan1'=>'*[じゅうはっ]分[ぷん]', // *
'sap6gau2fan1'=>'*[じゅうきゅう]分[ふん]',
'ji6sap6fan1'=>'*[にじゅっ]分[ぷん]',
'ji6sap6jat1fan1'=>'*[にじゅういっ]分[ぷん]',
'ji6sap6ji6fan1'=>'*[にじゅうに]分[ふん]',
'ji6sap6saam1fan1'=>'*[にじゅうさん]分[ぷん]', // *
'ji6sap6sei3fan1'=>'*[にじゅうよん]分[ぷん]', // *
'ji6sap6ng5fan1'=>'*[にじゅうご]分[ふん]',
'ji6sap6luk6fan1'=>'*[にじゅうろっ]分[ぷん]', // *
'ji6sap6cat1fan1'=>'*[にじゅうなな]分[ふん]',
'ji6sap6baat3fan1'=>'*[にじゅうはっ]分[ぷん]', // *
'ji6sap6gau2fan1'=>'*[にじゅうきゅう]分[ふん]',
'saam1sap6fan1'=>'*[さんじゅっ]分[ぷん]',
'saam1sap6jat1fan1'=>'*[さんじゅういっ]分[ぷん]',
'saam1sap6ji6fan1'=>'*[さんじゅうに]分[ふん]',
'saam1sap6saam1fan1'=>'*[さんじゅうさん]分[ぷん]', // *
'saam1sap6sei3fan1'=>'*[さんじゅうよん]分[ぷん]', // *
'saam1sap6ng5fan1'=>'*[さんじゅうご]分[ふん]',
'saam1sap6luk6fan1'=>'*[さんじゅうろっ]分[ぷん]', // *
'saam1sap6cat1fan1'=>'*[さんじゅうなな]分[ふん]',
'saam1sap6baat3fan1'=>'*[さんじゅうはっ]分[ぷん]', // *
'saam1sap6gau2fan1'=>'*[さんじゅうきゅう]分[ふん]',
'sei3sap6fan1'=>'*[よんじゅっ]分[ぷん]',
'sei3sap6jat1fan1'=>'*[よんじゅういっ]分[ぷん]',
'sei3sap6ji6fan1'=>'*[よんじゅうに]分[ふん]',
'sei3sap6saam1fan1'=>'*[よんじゅうさん]分[ぷん]', // *
'sei3sap6sei3fan1'=>'*[よんじゅうよん]分[ぷん]', // *
'sei3sap6ng5fan1'=>'*[よんじゅうご]分[ふん]',
'sei3sap6luk6fan1'=>'*[よんじゅうろっ]分[ぷん]', // *
'sei3sap6cat1fan1'=>'*[よんじゅうなな]分[ふん]',
'sei3sap6baat3fan1'=>'*[よんじゅうはっ]分[ぷん]', // *
'sei3sap6gau2fan1'=>'*[よんじゅうきゅう]分[ふん]',
'ng5sap6fan1'=>'*[ごじゅっ]分[ぷん]',
'ng5sap6jat1fan1'=>'*[ごじゅういっ]分[ぷん]',
'ng5sap6ji6fan1'=>'*[ごじゅうに]分[ふん]',
'ng5sap6saam1fan1'=>'*[ごじゅうさん]分[ぷん]', // *
'ng5sap6sei3fan1'=>'*[ごじゅうよん]分[ぷん]', // *
'ng5sap6ng5fan1'=>'*[ごじゅうご]分[ふん]',
'ng5sap6luk6fan1'=>'*[ごじゅうろっ]分[ぷん]', // *
'ng5sap6cat1fan1'=>'*[ごじゅうなな]分[ふん]',
'ng5sap6baat3fan1'=>'*[ごじゅうはっ]分[ぷん]', // *
'ng5sap6gau2fan1'=>'*[ごじゅうきゅう]分[ふん]',

'gam1ziu1'=>'今朝[けさ➀]',
'gam1jat6'=>'今日[きょう➀]',
'ming4jat6'=>'明[あ]日[した➂]',
'zok3jat6'=>'昨日[きのう➁⓪]',
'hau6jaut6'=>'明[あ]後日[さって➁]',
'cin4jat6'=>'一昨日[おととい➂]',
'zok3je6'=>'昨[さく]夜[や➁]',
'gam1je6'=>'今[こん]夜[や➀]',
'zok3maan5'=>'昨[さく]晩[ばん➁]',
'gam1maan5'=>'今[こん]晩[ばん]',
''=>'',
''=>'',
''=>'',



// 動詞
/*
// last accent before る/む normally
// except ⓪ 寝る, 働く, 帰る, etc
// https://www.tofugu.com/japanese-grammar/verb-conjugation-groups/
〜た (Past, Plain)
〜ない (Negative, Plain)
て Form
〜ている (Continuous)
〜そう (Looks Like)
〜たい (Desire)
〜たがる (Wants to)
〜ながら (Simultaneous)
〜なさい (Polite Command)
Command Form
〜やすい (Easy To)
〜にくい (Hard To)
〜させる (Causative)
〜ば (Conditional)
〜れる (Potential)
〜られる (Passive)
〜よう (Volitional)
*/
'bing6'=>'並[なら⓪]び:並[なら⓪]ぶ',
'biu2'=>'表[あらわ]し:表[あらわ➂]す',
'bok6'=>'泊[と]まり:泊[と⓪]まる', // to stay at (eg a hotel) ホテルに 〜
'bou6'=>'歩[ある]き:歩[ある➂]く:歩[ある]いて',
'caan4jip6'=>'残[ざん]業[ぎょう⓪]し:残[ざん]業[ぎょう⓪]する', // to work overtime
'cam2'=>'寝[ね]:寝[ね⓪]る', //
'ceoi2'=>'取[と]り:取[と➀]る',
'ceot1gwaa3'=>'出[で]掛[か]け:出[で]掛[か⓪]ける', // to go out, leave
'ceot1loi4'=>'出[で]来[き]:出[で]来[き➁]る', // to be able to
'ceot1zik6'=>'出[しゅっ]席[せき]し:出[しゅっ]席[せき⓪]する', // 会議に 〜
'ci2'=>'始[はじ]め:始[はじ⓪]める', // 会議を 〜
'ci4'=>'持[も]ち:持[も➀]つ:持[も]っ', // ち->っ 持った 持って
'cit3'=>'切[き]り:切[き➀]る',
'cyu5gam1'=>'貯[ちょ]金[きん]し:貯[ちょ]金[きん]する',
'cyun4'=>'伝[つた]え:伝[つた⓪]える', //Xに よろしく 伝えてください
'cyut3'=>'撮[と]り:撮[と➀]る',
'din6wa6'=>'電[でん]話[わ]する',
'dip6'=>'喋[しゃべ]り:喋[しゃべ➁]る',
'doi6'=>'待[ま]ち:待[ま➀]つ',
'dou6'=>'渡[わた]り:渡[わた⓪]る', // 橋を 〜
'duk6'=>'読[よ]み:読[よ➀]む',
'dung6'=>'働[はたら]き:働[はたら⓪]く',
'faan2'=>'返[かえ]し:返[かえ➀]す', // to give back, return sth 図書館に本を 〜
'fan1'=>'分[わ]かり:分[わ➁]かる',  // 入[はい]る
'fu1'=>'呼[よ]び:呼[よ⓪]ぶ', // b+t -> nd 呼んだ
'fu6'=>'付[つ]け:付[つ➁]ける:払い:払[はら➁]う', // 電気[➀]を 〜 to turn on the light; to pay
'gaam2'=>'減[へ]り:減[へ⓪]る',
'gaau3'=>'教[おし]え:教[おし⓪]える', // 日本語を教えています
'gap1'=>'急[いそ]ぎ:急[いそ➁]ぐ', // gi+t -> id 急ぎた->急いだ
'gin3'=>'見[み]:見[み➀]る:見[み]せ:見[み➁]せる',
'git3fan1'=>'結[けっ]婚[こん]し:結[けっ]婚[こん⓪]する',
'go1'=>'歌[うた]い:歌[うた⓪]う',
'gok3'=>'覚[おぼ]え:覚[おぼ➂]える:', // to memorize 覚えています I remember
'gong3'=>'降[ふ]り:降[ふ➀]る', // り->っ
'gwaa3'=>'掛[か]け:掛[か]ける', // 電話を掛ける 眼鏡
'gwai1'=>'帰[かえ]り:帰[かえ➀]る',
'gwan1'=>'慣[な]れ:慣[な➁]れる',
'hang4'=>'行[い]き:行[い⓪]く',
'hap6gaak3'=>'合[ごう]格[かく]し:合[ごう]格[かく⓪]する', // N5に 〜
'hei2'=>'起[お]き:起[お➁]きる',
'hoi1'=>'開[あ⓪]く:開[あ⓪]ける:開[ひら]く', // ドアを 開[あ⓪]けます
'jam2'=>'飲[の]み:飲[の➀]む', // m+t -> nd 飲んだ
'jap6'=>'入[はい]り:入[はい➀]る:入[い]れ:入[い⓪]れる:込[こ]み:込[こ➀]む',// to be crowded 道[みち⓪]が込んでいます
'jap6jyun6'=>'入[にゅう]院[いん]する',
'jau1'=>'休[やす]み:休[やす➂]む', // 仕事を休みます
'jau4'=>'遊[あそ]び:遊[あそ⓪]ぶ',
'jau5'=>'有[あ]り:有[あ➀]る:誘[さそ]い:誘[さそ⓪]う',
'jin4'=>'言[い]い:言[い]う',
'juk6'=>'浴[あ]び:浴[あ⓪]びる', // シャワー[➀]を 〜 to take a shower
'jyu5joek3'=>'予[よ]約[やく⓪]し:予[よ]約[やく⓪]する', // レストランを 〜
'kuk1'=>'曲[ま]がり:曲[ま⓪]がる', // 交差点を 〜
'laai6'=>'頼[たの]み:頼[たの➁]む',
'lap6'=>'立[た]ち:立[た➀]つ',
'lei4fan1'=>'離[り]婚[こん]し:離[り]婚[こん⓪]する', // Xと 〜
'lei5'=>'履[は]き:履[は⓪]く', // to wear (lower-body clothing, shoes)
'leoi5hang4'=>'旅[りょ]行[こう]し:旅[りょ]行[こう⓪]する';
'lin4lok3'=>'連[れん]絡[らく]し:連[れん]絡[らく⓪]する',
'loi4'=>'来[き]:来[く➀]る:来[こ]',
'maai5'=>'買[か]い:買[か⓪]う:買[か]わ:買[か]え:買[か]お', // wi->っ 
'maai6'=>'売[う]り:売[う⓪]る', // 入[はい]る
'man4'=>'聞[き]き:聞[き⓪]く:聞[き]い:聞[き]か:聞[き]け:聞[き]こ', // ki+t -> it 聞いた
'man6'=>'問[と]い:問[と⓪]う',
'min5koeng5'=>'勉[べん]強[きょう]し:勉[べん]強[きょう⓪]する',
'miu4'=>'描[か]き:描[か➀]く',
'mo4'=>'磨[みが]き:磨[みが⓪]く',
'mong4'=>'忘[わす]れ:忘[わす⓪]れる', // 家に携帯を 〜
'pei1'=>'被[かぶ]り:被[かぶ➁]る', // to wear hat 帽子を 〜
'pin3fu6'=>'片[かた]付[づ]け:片[かた]付[づ➃]ける', // tidy up, clean up 部屋を 〜
'sai2'=>'洗[あら]い:洗[あら⓪]う',
'sai2zok6'=>'洗[せん]濯[たく]し:洗[せん]濯[たく⓪]する',
'sam1pui3'=>'心[しん]配[ぱい]し:心[しん]配[ぱい⓪]する', // to worry
'sap6'=>'拾[ひろ]い:拾[ひろ⓪]う', // to pick up sth
'se2'=>'捨[す]て:捨[す⓪]てる', // to throw away, give up ゴミを 〜 to throw away garbage
'sei2'=>'死[し⓪]ぬ', // n+t->nd 死んだ 死んで
'si1'=>'思[おも]い:思[おも➁]う',
'si2'=>'使[つか]い:使[つか⓪]う',
'sik1'=>'飾[かざ]り:飾[かざ⓪]る',
'sik6'=>'食[た]べ:食[た➁]べる',
'sing4'=>'成[な]り:成[な➀]る:乗[の]り:乗[の⓪]る', // 電車に 乗ります
'siu1'=>'消[け]し:消[け⓪]す', // 電気[➀]を 〜 to turn off the light
'siu3'=>'咲[さ]き:咲[さ⓪]く', // to bloom 桜が 咲いています
'siu6gaai3'=>'紹[しょう]介[かい]し:紹[しょう]介[かい⓪]する', // Xに Yを 〜 to introduce Y to X
'sou3ceoi4'=>'掃[そう]除[じ]し:掃[そう]除[じ⓪]する',
'sung3'=>'送[おく]り:送[おく⓪]る', // メールを送[おく]ります
'syu1'=>'書[か]き:書[か➀]く',
'taai3'=>'貸[か]し:貸[か⓪]す:太[ふと]り:太[ふと➁]る', // 友達に
'taam3'=>'探[さが⓪]す', // 指す to look for 眼鏡を 〜
'taan4'=>'弾[ひ]き:弾[ひ⓪]く',
'teoi3jyun6'=>'退[たい]院[いん⓪]する',
'waa6'=>'話[はな]し:話[はな➁]す',
'wan6'=>'運[はこ]び:運[はこ⓪]ぶ',
'wan6dung6'=>'運[うん]動[どう]し:運[うん]動[どう⓪]する',
'wing6'=>'泳[およ]ぎ:泳[およ➁]ぐ', // gi+t -> id 
'wui6'=>'会[あ]い:会[あ➀]う', 
'zaap6'=>'習[なら]い:習[なら➁]う',
'zat1man6'=>'質[しつ]問[もん]し:質[しつ]問[もん⓪]する', // Xに 〜
'zau2'=>'走[はし]り:走[はし➁]る',
'ze3'=>'借[か]り:借[か⓪]りる', // 友達に
'zeoi1'=>'追[お⓪]う:負[お⓪]う',
'zi1'=>'知[し]り:知[し⓪]る', // 森[もり⓪]さんを 〜 to know sb
'zi2'=>'止[と]まり:止[と⓪]まる', // to stop
'zi3'=>'置[お]き:置[お⓪]く',
'zi6'=>'飼[か]い:飼[か➀]う', // 猫を飼うっています I have a cat
'ziu1doi6'=>'招[しょう]待[たい]し:招[しょう]待[たい➀]する',
'zit3'=>'折[お]り:折[お➀]る',
'zo6'=>'座[すわ]り:座[すわ⓪]る',
'zoek3'=>'着[き]:着[き⓪]る', // コートを 〜 to wear coat
'zoek6'=>'着[つ]き:着[つ➀]く', // to arrive 大阪に 〜
'zok3'=>'作[つく]り:作[つく➁]る', // 晩御飯を 〜
'zung1'=>'終[お]わり:終[お⓪]わる', // 畢る, 竟る, 卒わる, 了わる
'zyu6'=>'住[す]み:住[す➀]む', // 東京に 〜
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',

// 國家、地名
'aai1gap6'=>'エジプト[⓪]',
'baa1saai1'=>'ブラジル[⓪]',
'dak1gwok3'=>'ドイツ[①]',
'faat3gwok3'=>'フランス[⓪]',
'fei1leot6ban1'=>'フィリピン[➀]',
'gaa1naa4daai6'=>'カナダ[➀]',
'hon4gwok3'=>'韓[かん]国[こく➀]',
'jan3dou6'=>'インド[➀]',
'jan3nei4'=>'インドネシア[➃]',
'ji1long5'=>'イラン[➀]',
'ji3daai6lei6'=>'イタリア[⓪]',
'jing1gwok3'=>'イギリス[⓪]',
'jyut6naam4'=>'ベトナム[⓪]',
'maa5loi4sai1aa3'=>'マレーシア[➁]',
'maak6saai1go1'=>'メキシコ[⓪]',
'mei5gwok3'=>'アメリカ[⓪]',
'ngo4gwok3'=>'ロシア[➀]',
'ou3zau1'=>'オーストラリア[➄]',
'pou4tou4ngaa4'=>'ポルトガル[⓪]',
'saa1dei6a3laai1baak3'=>'サウジアラビア[➃]',
'saai1baan1ngaa4'=>'スペイン[➁]',
'san1sai1laan4'=>'ニュージーランド[➂]',
'sang1gaa1bo1'=>'シンガポール[➃]',
'taai3gwok3'=>'タイ[➀]',
'zung1gwok3'=>'中[ちゅう]国[ごく➀]',
'seoi6si4'=>'スイス[➀]',
'zaau2waa1'=>'フランス[⓪]',
'maan6guk1'=>'バンコク[➀]',
'paak3lam4'=>'ベルリン[➂]',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',

// 日本專有名詞
'gwong2dou2'=>'広[ひろ]島[しま⓪]', // 
'bak1hoi2dou6'=>'北海道[ほ➁っか➁いどう]', // 
'ging1dou1'=>'*京[きょう]都[と➀]', // 
'daai6baan2'=>'大[おお]阪[さか⓪]', // 
'dung1ging1'=>'東[とう]京[きょう⓪]', // 
'noi6loeng4'=>'奈[な]良[ら➀]',
'gaap3zi2jyun4'=>'甲[こう]子[し]園[えん➂]', // 大阪
'fu3si6saan1'=>'富[ふ]士[じ]山[さん➀]',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',



''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',

'cing1seoi2'=>'清[し]水[みず⓪]',
'cung4bun2'=>'松[まつ]本[もと⓪]',// 
'cung4jyun4'=>'松[まつ]原[ばら➁]',
'cyun1saan1'=>'村[むら]山[やま⓪]',
'dou6bin1'=>'渡[わた]辺[なべ⓪]',
'gaa1tang4'=>'加[か]藤[とう⓪]',
'gat1tin4'=>'吉[よし]田[た⓪]',
'gou2kiu4'=>'高[たか]橋[はし➁]',
'haa6ding6'=>'下[しも]定[さだ]',
'ji1tang4'=>'*伊[い]藤[とう⓪]', // 
'lam4'=>'林[ばやし➂]',// 
'ling4muk6'=>'鈴[すず]木[き⓪]',// 
'muk6cyun1'=>'木[き]村[むら⓪]', // 
'saan1bun2'=>'山[やま]本[もと⓪]',
'saan1hau2'=>'山[やま]口[ぐち➁]',
'saan1tin4'=>'山[やま]田[だ⓪]', // 
'sing4gong1'=>'城[しろ]岡[おか]',
'siu2lam4'=>'*小[こ]林[ばやし⓪]',// 
'taai3long4'=>'太[た]郎[ろう➀]',
'takashi'=>'たかし[➀]', // 
'tin4zung1'=>'田[た]中[なか⓪]',// 
'zai1tang4'=>'斎[さい]藤[とう⓪]',
'zing2soeng6'=>'井[いの]上[うえ⓪]',
'zo3tang4'=>'佐[さ]藤[とう⓪]',// 
'zo3zo3muk6'=>'佐[さ]々[さ]木[き⓪]',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',

);
?>