<?php
$粵和詞典=array(
'gaa2ming4'=>
'*あア*いイ*うウ*えエ*おオ
*かカ*きキ*くク*けケ*こコ
*がガ*ぎギ*ぐグ*げゲ*ごゴ
*きゃキャ*きゅキュ*きょキョ
*ぎゃギャ*ぎゅギュ*ぎょギョ
*さサ*しシ*すス*せセ*そソ
*ざザ*じジ*ずズ*ぜゼ*ぞゾ
*しゃシャ*しゅシュ*しょショ
*じゃジャ*じゅジュ*じょジョ
*たタ*ちチ*つツ*てテ*とト
*だダ*ぢヂ*づヅ*でデ*どド
*ちゃチャ*ちゅチュ*ちょチョ
*ぢゃヂャ*ぢゅヂュ*ぢょヂョ
*なナ*にニ*ぬヌ*ねネ*のノ
*にゃニャ*にゅニュ*にょニョ
*はハ*ひヒ*ふフ*へヘ*ほホ
*ばバ*びビ*ぶブ*べベ*ぼボ
*ぱパ*ぴピ*ぷプ*ぺペ*ぽポ
*ひゃヒャ*ひゅヒュ*ひょヒョ
*びゃビャ*びゅビュ*びょビョ
*ぴゃピャ*ぴゅピュ*ぴょピョ
*まマ*みミ*むム*めメ*もモ
*みゃミャ*みゅミュ*みょミョ
*やヤ*ゆユ*よヨ
*らラ*りリ*るル*れレ*ろロ
*りゃリャ*りゅリュ*りょリョ
*わワ*をヲ
*んン
*ヴ
*ゃゅょャュョ
*っッ
*ぁぃぅぇぉァィゥェォ
*ゐヰヸゑヱー
*゛゜
*か゜ nga あﾞエﾞ
',
'jat1gaai1'=>'*[いっ]階[かい⓪]', // *
'ji6gaai1'=>'*[に]階[かい⓪]',
'saam1gaai1'=>'*[さん]階[がい⓪]', // *
'sei3gaai1'=>'*[よん]階[かい⓪]',
'ng5gaai1'=>'*[ご]階[かい⓪]',
'luk6gaai1'=>'*[ろっ]階[かい⓪]', // *
'cat1gaai1'=>'*[なな]階[かい⓪]',
'baat3gaai1'=>'*[はっ]階[かい⓪]', // *
'gau2gaai1'=>'*[きゅう]階[かい]',
'sap6gaai1'=>'*[じゅっ]階[かい]', // *

'jat1seoi3'=>'*[いっ]歳',
'baat3seoi3'=>'*[はっ]歳',
'sap6seoi3'=>'*[じゅっ]歳',
'ji6sap6seoi3'=>'*はたち[➀]',


''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
);
?>