<?php
$粵和詞典=array(
'gaa2ming4'=>
'*あア*いイ*うウ*えエ*おオ
*かカ*きキ*くク*けケ*こコ
*がガ*ぎギ*ぐグ*げゲ*ごゴ
*きゃキャ*きゅキュ*きょキョ
*ぎゃギャ*ぎゅギュ*ぎょギョ
*さサ*しシ*すス*せセ*そソ
*ざザ*じジ*ずズ*ぜゼ*ぞゾ
*しゃシャ*しゅシュ*しょショ
*じゃジャ*じゅジュ*じょジョ
*たタ*ちチ*つツ*てテ*とト
*だダ*ぢヂ*づヅ*でデ*どド
*ちゃチャ*ちゅチュ*ちょチョ
*ぢゃヂャ*ぢゅヂュ*ぢょヂョ
*なナ*にニ*ぬヌ*ねネ*のノ
*にゃニャ*にゅニュ*にょニョ
*はハ*ひヒ*ふフ*へヘ*ほホ
*ばバ*びビ*ぶブ*べベ*ぼボ
*ぱパ*ぴピ*ぷプ*ぺペ*ぽポ
*ひゃヒャ*ひゅヒュ*ひょヒョ
*びゃビャ*びゅビュ*びょビョ
*ぴゃピャ*ぴゅピュ*ぴょピョ
*まマ*みミ*むム*めメ*もモ
*みゃミャ*みゅミュ*みょミョ
*やヤ*ゆユ*よヨ
*らラ*りリ*るル*れレ*ろロ
*りゃリャ*りゅリュ*りょリョ
*わワ*をヲ
*んン
*ヴ
*ゃゅょャュョ
*っッ
*ぁぃぅぇぉァィゥェォ
*ゐヰヸゑヱー
*゛゜
*か゜ nga あﾞエﾞ
',
'jat1gaai1'=>'*[いっ]階[かい⓪]', // *
'ji6gaai1'=>'*[に]階[かい⓪]',
'saam1gaai1'=>'*[さん]階[がい⓪]', // *
'sei3gaai1'=>'*[よん]階[かい⓪]',
'ng5gaai1'=>'*[ご]階[かい⓪]',
'luk6gaai1'=>'*[ろっ]階[かい⓪]', // *
'cat1gaai1'=>'*[なな]階[かい⓪]',
'baat3gaai1'=>'*[はっ]階[かい⓪]', // *
'gau2gaai1'=>'*[きゅう]階[かい]',
'sap6gaai1'=>'*[じゅっ]階[かい]', // *

'jat1seoi3'=>'*[いっ]歳',
'baat3seoi3'=>'*[はっ]歳',
'sap6seoi3'=>'*[じゅっ]歳',
'ji6sap6seoi3'=>'*はたち[➀]',

'jat1nin4'=>'*いち年[ねん➁]',
'ji6nin4'=>'*に年[ねん]',
'saam3nin4'=>'*さん年[ねん]',
'sei3nin4'=>'*よ年[ねん]', // *
'ng5nin4'=>'*ご年[ねん]',
'luk6nin4'=>'*ろく年[ねん]',
'cat1nin4'=>'*なな年[ねん]:しち年[ねん]', // *
'baat3nin4'=>'*はち年[ねん]',
'gau2nin4'=>'*きゅう年[ねん]', // *
'jat1ling4nin4'=>'*じゅう年[ねん]',
'ji6ling4ji6ng5nin4'=>'*にせんにじゅうご年[ねん]',

// 4 7 9
'jat1jut6'=>'*いち月[がつ➂]',
'ji6jut6'=>'*に月[がつ➂]',
'saam1jut6'=>'*さん月[がつ➀]',
'sei3jut6'=>'*[し]月[がつ➂]', // *
'ng5jut6'=>'*ご月[がつ➀]',
'luk6jut6'=>'*ろく月[がつ➂]',
'cat1jut6'=>'*しち月[がつ➂]', // *
'baat3jut6'=>'*はち月[がつ➂]',
'gau2jut6'=>'*く月[がつ➀]', // *
'sap6jut6'=>'*じゅう月[がつ➂]',
'sap6jat1jut6'=>'*じゅういち月[がつ⓪]',
'sap6ji6jut6'=>'*じゅうに月[がつ➂]',

'jat1jat6'=>'*ついたち[➂]', // 朔日
'ji6jat6'=>'*ふつか[⓪]', //
'saam1jat6'=>'*みっか[⓪]', //
'sei3jat6'=>'*よっか[⓪]', //
'ng5jat6'=>'*いつか[➂]', //
'luk6jat6'=>'*むいか[⓪]', // 
'cat1jat6'=>'*なのか[⓪]', //
'baat3jat6'=>'*ようか[⓪]', //
'gau2jat6'=>'*ここのか[➂]', //
'sap6jat6'=>'*とおか[⓪]', //
'sap6jat1jat6'=>'*じゅういち日[にち➂]',
'sap6ji6jat6'=>'*じゅうに日[にち]',
'sap6saam1jat6'=>'*じゅうさん日[にち]',
'sap6sei3jat6'=>'*じゅうよっか[➀-⓪]', //  *
'sap6ng5jat6'=>'*じゅうご日[にち]',
'sap6luk6jat6'=>'*じゅうろく日[にち]',
'sap6cat1jat6'=>'*じゅうしち日[にち]', // *
'sap6baat3jat6'=>'*じゅうはち日[にち]',
'sap6gau2jat6'=>'*じゅうく日[にち]', // *
'ji6sap6jat6'=>'*はつか[⓪]', // *
'ji6sap6jat1jat6'=>'*にじゅういち日[にち]',
'ji6sap6ji6jat6'=>'*にじゅうに日[にち]',
'ji6sap6saam1jat6'=>'*にじゅうさん日[にち]',
'ji6sap6sei3jat6'=>'*にじゅうよっか[➀-⓪]', // *
'ji6sap6ng5jat6'=>'*にじゅうご日[にち]',
'ji6sap6luk6jat6'=>'*にじゅうろく日[にち]',
'ji6sap6cat1jat6'=>'*にじゅうしち日[にち]', // *
'ji6sap6baat3jat6'=>'*にじゅうはち日[にち]',
'ji6sap6gau2jat6'=>'*にじゅうく日[にち]', // *
'saam1sap6jat6'=>'*さんじゅう日[にち]',
'saam1sap6jat1jat6'=>'*さんじゅういち日[にち]',

// 4 7 9
'ling4si4'=>'*[れい]時[じ➀]',
'jat1si4'=>'*[いち]時[じ➁]',
'ji6si4'=>'*[に]時[じ➀]',
'saam1si4'=>'*[さん]時[じ➀]',
'sei3si4'=>'*[よ]時[じ]', // *
'ng5si4'=>'*[ご]時[じ]',
'luk6si4'=>'*[ろく]時[じ➁]',
'cat1si4'=>'*[しち]時[じ➁]', // *
'baat3si4'=>'*[はち]時[じ➁]',
'gau2si4'=>'*[く]時[じ➀]', // *
'sap6si4'=>'*[じゅう]時[じ]',
'sap6jat1si4'=>'*[じゅういち]時[じ]',
'sap6ji6si4'=>'*[じゅうに]時[じ]',
'sap6saam1si4'=>'*[じゅうさん]時[じ➀]',
'sap6sei3si4'=>'*[じゅうよ]時[じ]', // *
'sap6ng5si4'=>'*[じゅうご]時[じ]',
'sap6luk6si4'=>'*[じゅうろく]時[じ➁]',
'sap6cat1si4'=>'*[じゅうしち]時[じ➁]', // *
'sap6baat3si4'=>'*[じゅうはち]時[じ➁]',
'sap6gau2si4'=>'*[じゅうく]時[じ➀]', // *
'ji6sap6si4'=>'*[にじゅう]時[じ]',
'ji6sap6jat1si4'=>'*[にじゅういち]時[じ]',
'ji6sap6ji6si4'=>'*[にじゅうに]時[じ]',
'ji6sap6saam1si4'=>'*[にじゅうさん]時[じ➀]',
'ji6sap6sei3si4'=>'*[にじゅうよ]時[じ]', // *

// 1, 3, 4, 6, 8, 10
'jat1fan1'=>'*[いっ]分[ぷん]', // *
'ji6fan1'=>'*[に]分[ふん]',
'saam1fan1'=>'*[さん]分[ぷん]', // *
'sei3fan1'=>'*[よん]分[ぷん]', // *
'ng5fan1'=>'*[ご]分[ふん]',
'luk6fan1'=>'*[ろっ]分[ぷん]', // *
'cat1fan1'=>'*[なな]分[ふん]',
'baat3fan1'=>'*[はっ]分[ぷん]', // *
'gau2fan1'=>'*[きゅう]分[ふん]',
'sap6fan1'=>'*[じゅっ]分[ぷん]', // *
'sap6jat1fan1'=>'*[じゅういっ]分[ぷん]',
'sap6ji6fan1'=>'*[じゅうに]分[ふん]',
'sap6saam1fan1'=>'*[じゅうさん]分[ぷん]', // *
'sap6sei3fan1'=>'*[じゅうよん]分[ぷん]', // *
'sap6ng5fan1'=>'*[じゅうご]分[ふん]',
'sap6luk6fan1'=>'*[じゅうろっ]分[ぷん]', // *
'sap6cat1fan1'=>'*[じゅうなな]分[ふん]',
'sap6baat3fan1'=>'*[じゅうはっ]分[ぷん]', // *
'sap6gau2fan1'=>'*[じゅうきゅう]分[ふん]',
'ji6sap6fan1'=>'*[にじゅっ]分[ぷん]',
'ji6sap6jat1fan1'=>'*[にじゅういっ]分[ぷん]',
'ji6sap6ji6fan1'=>'*[にじゅうに]分[ふん]',
'ji6sap6saam1fan1'=>'*[にじゅうさん]分[ぷん]', // *
'ji6sap6sei3fan1'=>'*[にじゅうよん]分[ぷん]', // *
'ji6sap6ng5fan1'=>'*[にじゅうご]分[ふん]',
'ji6sap6luk6fan1'=>'*[にじゅうろっ]分[ぷん]', // *
'ji6sap6cat1fan1'=>'*[にじゅうなな]分[ふん]',
'ji6sap6baat3fan1'=>'*[にじゅうはっ]分[ぷん]', // *
'ji6sap6gau2fan1'=>'*[にじゅうきゅう]分[ふん]',
'saam1sap6fan1'=>'*[さんじゅっ]分[ぷん]',
'saam1sap6jat1fan1'=>'*[さんじゅういっ]分[ぷん]',
'saam1sap6ji6fan1'=>'*[さんじゅうに]分[ふん]',
'saam1sap6saam1fan1'=>'*[さんじゅうさん]分[ぷん]', // *
'saam1sap6sei3fan1'=>'*[さんじゅうよん]分[ぷん]', // *
'saam1sap6ng5fan1'=>'*[さんじゅうご]分[ふん]',
'saam1sap6luk6fan1'=>'*[さんじゅうろっ]分[ぷん]', // *
'saam1sap6cat1fan1'=>'*[さんじゅうなな]分[ふん]',
'saam1sap6baat3fan1'=>'*[さんじゅうはっ]分[ぷん]', // *
'saam1sap6gau2fan1'=>'*[さんじゅうきゅう]分[ふん]',
'sei3sap6fan1'=>'*[よんじゅっ]分[ぷん]',
'sei3sap6jat1fan1'=>'*[よんじゅういっ]分[ぷん]',
'sei3sap6ji6fan1'=>'*[よんじゅうに]分[ふん]',
'sei3sap6saam1fan1'=>'*[よんじゅうさん]分[ぷん]', // *
'sei3sap6sei3fan1'=>'*[よんじゅうよん]分[ぷん]', // *
'sei3sap6ng5fan1'=>'*[よんじゅうご]分[ふん]',
'sei3sap6luk6fan1'=>'*[よんじゅうろっ]分[ぷん]', // *
'sei3sap6cat1fan1'=>'*[よんじゅうなな]分[ふん]',
'sei3sap6baat3fan1'=>'*[よんじゅうはっ]分[ぷん]', // *
'sei3sap6gau2fan1'=>'*[よんじゅうきゅう]分[ふん]',
'ng5sap6fan1'=>'*[ごじゅっ]分[ぷん]',
'ng5sap6jat1fan1'=>'*[ごじゅういっ]分[ぷん]',
'ng5sap6ji6fan1'=>'*[ごじゅうに]分[ふん]',
'ng5sap6saam1fan1'=>'*[ごじゅうさん]分[ぷん]', // *
'ng5sap6sei3fan1'=>'*[ごじゅうよん]分[ぷん]', // *
'ng5sap6ng5fan1'=>'*[ごじゅうご]分[ふん]',
'ng5sap6luk6fan1'=>'*[ごじゅうろっ]分[ぷん]', // *
'ng5sap6cat1fan1'=>'*[ごじゅうなな]分[ふん]',
'ng5sap6baat3fan1'=>'*[ごじゅうはっ]分[ぷん]', // *
'ng5sap6gau2fan1'=>'*[ごじゅうきゅう]分[ふん]',

// 動詞
'dung5'=>'働[はたら⓪]く:働[はたら]きます',
'hei2'=>'起[お➁]きる:起[お]きます',
'jau1'=>'休[やす➂]む:休[やす]みます',
'cam2'=>'寝[ね⓪]る:寝[ね]ます',
'mo4'=>'磨[みが⓪]く:磨[みが]きます',
'min5koeng5'=>'勉[べん]強[きょう⓪]する:勉[べん]強[きょう]します',
'zung1'=>'終[お⓪]わる:終[お]わります',
'bou6'=>'歩[ある➂]く:歩[ある]きます:歩[ある]いて',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',

// 國家
'mei5gwok3'=>'アメリカ[⓪]',
'jing1gwok3'=>'イギリス[⓪]',
'ji3daai6lei6'=>'イタリア[⓪]',
'ji1long5'=>'イラン[➀]',
'jan3dou6'=>'インド[➀]',
'jan3nei4'=>'インドネシア[➃]',
'aai1gap6'=>'エジプト[⓪]',
'ou3zau1'=>'オーストラリア[➄]',
'san1sai1laan4'=>'ニュージーランド[➂]',
'gaa1naa4daai6'=>'カナダ[➀]',
'hon4gwok3'=>'韓[かん]国[こく➀]',
'saa1dei6a3laai1baak3'=>'サウジアラビア[➃]',
'sang1gaa1bo1'=>'シンガポール[➃]',
'saai1baan1ngaa4'=>'スペイン[➁]',
'taai3gwok3'=>'タイ[➀]',
'zung1gwok3'=>'中[ちゅう]国[ごく➀]',
'dak1gwok3'=>'ドイツ[①]',
'faat3gwok3'=>'フランス[⓪]',
'fei1leot6ban1'=>'フィリピン[➀]',
'baa1saai1'=>'ブラジル[⓪]',
'pou4tou4ngaa4'=>'ポルトガル[⓪]',
'jyut6naam4'=>'ベトナム[⓪]',
'maa5loi4sai1aa3'=>'マレーシア[➁]',
'maak6saai1go1'=>'メキシコ[⓪]',
'ngo4gwok3'=>'ロシア[➀]',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',

''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
''=>'',
);
?>